docs/index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-07-27 Wed 02:32 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Yash Honda PDF (=yhpdf=) Manual</title>
<meta name="author" content="Nebhrajani A.V." />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">Yash Honda PDF (<code>yhpdf</code>) Manual</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgd611a48">1. Installation</a>
<ul>
<li><a href="#org95f5924">1.1. Basic</a></li>
<li><a href="#org11d8eae">1.2. Advanced</a></li>
</ul>
</li>
<li><a href="#orgc8dc47d">2. Usage</a></li>
<li><a href="#org184ba7f">3. Technical Description</a>
<ul>
<li><a href="#orgd3cfefa">3.1. What?</a></li>
<li><a href="#org9408845">3.2. How?</a></li>
<li><a href="#org2186e05">3.3. Known Issues</a></li>
</ul>
</li>
<li><a href="#orgc10856b">4. <code>yhpdf.py</code> Source</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgd611a48" class="outline-2">
<h2 id="orgd611a48"><span class="section-number-2">1.</span> Installation</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org95f5924" class="outline-3">
<h3 id="org95f5924"><span class="section-number-3">1.1.</span> Basic</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Use MS Windows 10.
</p>

<ol class="org-ol">
<li>Install <b>Ghostscript (64-bit)</b>:
<ol class="org-ol">
<li>Go to <span class="underline"><a href="https://ghostscript.com/releases/gsdnld.html">https://ghostscript.com/releases/gsdnld.html</a></span>.</li>
<li>Download the file <b>Ghostscript for Windows (64 bit)</b> with
the AGPL license. <span class="underline">Do not use the 32 bit
version, it is incompatible with <code>yhpdf</code>.</span></li>
<li>Run the installer with the standard steps, and click <code>Finish</code>
once done. It should launch a website, telling you Ghostscript
is installed.</li>
</ol></li>
<li>Get <b>yhpdf</b>:
<ol class="org-ol">
<li>Download <code>yhpdf.exe</code> from
<span class="underline"><a href="https://github.com/nebhrajani-a/yhpdf/releases/download/v1.4/yhpdf.exe">https://github.com/nebhrajani-a/yhpdf/releases/download/v1.4/yhpdf.exe</a></span>.
Your browser may call it &ldquo;Dangerous&rdquo; since it&rsquo;s not a
Microsoft-verified program. Click the arrow for options and
select &ldquo;Keep&rdquo;.</li>
<li>Copy <code>yhpdf</code> from your <code>Downloads</code> folder and paste it in
<code>C:\Program Files</code> (This PC \(\rightarrow\) Local Disk
\(\rightarrow\) Program Files).</li>
<li>Double click on <code>yhpdf</code>.
<ol class="org-ol">
<li>If &ldquo;Windows protected your PC&rdquo; launches, click &ldquo;More
info&rdquo;, then select &ldquo;Run anyway&rdquo; on the bottom right.
Windows will remember your preference.</li>
<li><span class="underline">Wait for 20 seconds</span>. If it doesn&rsquo;t
launch, double click again, and wait for 10 more seconds. On
old machines, <code>yhpdf</code> takes time to start up. Be patient, it
runs much faster than it starts.</li>
</ol></li>
<li>Once it starts, you should see a window with four buttons and
some text. Go down to the taskbar, right click on <code>yhpdf</code>&rsquo;s
feather icon, and select &ldquo;Pin to taskbar&rdquo;.</li>
<li><code>yhpdf</code> is now ready for use.</li>
<li>If <code>yhpdf</code> doesn&rsquo;t start and reports an error, make sure
Ghostscript is installed. If there&rsquo;s some other error you
can&rsquo;t resolve, report it to the package maintainer.</li>
</ol></li>
</ol>
</div>
</div>

<div id="outline-container-org11d8eae" class="outline-3">
<h3 id="org11d8eae"><span class="section-number-3">1.2.</span> Advanced</h3>
<div class="outline-text-3" id="text-1-2">
<p>
On any platform, install Python 3 and Ghostscript 64-bit. Then,
<code>pip3 install pypdf2 ghostscript</code>. Run with <code>python3 yhpdf.py</code>.
</p>
</div>
</div>
</div>

<div id="outline-container-orgc8dc47d" class="outline-2">
<h2 id="orgc8dc47d"><span class="section-number-2">2.</span> Usage</h2>
<div class="outline-text-2" id="text-2">
<p>
Usage is intuitive:
</p>

<ol class="org-ol">
<li>Click &ldquo;Select a file&rdquo; to upload the PDF you want to split and
compress.
<ol class="org-ol">
<li>A popup will tell you which file has been selected.
Click &ldquo;OK&rdquo;.</li>
</ol></li>
<li>Click &ldquo;Select output folder&rdquo; to select the folder into which the
new PDFs will be put.
<ol class="org-ol">
<li>A popup will tell you which folder has been selected. Click
&ldquo;OK&rdquo;.</li>
</ol></li>
<li>Click &ldquo;Process PDF&rdquo; to process the PDF. This can take up to 60
seconds, depending on the speed of your machine and the size of
the input PDF.
<ol class="org-ol">
<li><span class="underline">Do not close <code>yhpdf</code> even if Windows says &ldquo;Not Responding&rdquo;</span>.
Killing <code>yhpdf</code> may damage the output. Wait for it to
complete.</li>
<li>Once the PDF process is complete, a popup will ask you if you
want to view the output files. Click &ldquo;Yes&rdquo;.</li>
</ol></li>
<li>Repeat steps 1 to 3 for as many PDFs as required.</li>
<li>Click &ldquo;Exit&rdquo; when you&rsquo;re done.</li>
</ol>
</div>
</div>


<div id="outline-container-org184ba7f" class="outline-2">
<h2 id="org184ba7f"><span class="section-number-2">3.</span> Technical Description</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-orgd3cfefa" class="outline-3">
<h3 id="orgd3cfefa"><span class="section-number-3">3.1.</span> What?</h3>
<div class="outline-text-3" id="text-3-1">
<p>
<code>yhpdf</code> is a GUI tool which:
</p>
<ul class="org-ul">
<li>Takes an input PDF file.</li>
<li>Splits it into one PDF file per page.</li>
<li>Compresses each page PDF to less than 195KB.</li>
</ul>

<p>
Given the intended use-case, the only platform with first-class
support is MS Windows 10 (compiled binary provided). None of the
Python is OS-specific though, and the CI tests run on Ubuntu.
</p>
</div>
</div>

<div id="outline-container-org9408845" class="outline-3">
<h3 id="org9408845"><span class="section-number-3">3.2.</span> How?</h3>
<div class="outline-text-3" id="text-3-2">
<p>
<code>yhpdf</code> uses PyPDF2 to split the PDF page-wise, then uses
Ghostscript&rsquo;s compression on each of these pages. If the file size
is greater than 195KB, it first tries <code>-dPDFSETTINGS=/ebook</code>. If
the file size is still greater than 195KB, it tries
<code>-dPDFSETTINGS=/screen</code>. This gets most scanned pages below 200KB.
If this fails, it raises an error. In essence, <code>yhpdf</code> is just a
<code>for</code> loop which generates per-page PDFs then compresses them.
</p>

<p>
The GUI uses Tkinter and is cross-platform. If you&rsquo;re proficient in
Python, you can probably get <code>yhpdf.py</code> running in your own
environment.
</p>
</div>
</div>

<div id="outline-container-org2186e05" class="outline-3">
<h3 id="org2186e05"><span class="section-number-3">3.3.</span> Known Issues</h3>
<div class="outline-text-3" id="text-3-3">
<p>
The biggest user-facing issue is the slow startup time. This is
unfortunately out of <code>yhpdf</code>&rsquo;s control, since <code>pyinstaller</code> in
single file mode needs to decompress the (single) <code>.exe</code> file to
run, which takes time, especially on Windows because of virus
scanning.
</p>

<p>
If this bothers you, either keep it running all the time by
auto-starting it (it uses next to no RAM and CPU while idling), or
get Python and run it from the command line.
</p>
</div>
</div>
</div>

<div id="outline-container-orgc10856b" class="outline-2">
<h2 id="orgc10856b"><span class="section-number-2">4.</span> <code>yhpdf.py</code> Source</h2>
<div class="outline-text-2" id="text-4">
<p>
<a href="https://github.com/nebhrajani-a/yhpdf">https://github.com/nebhrajani-a/yhpdf</a>
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<hr><p style="font-size: 75%">Created in GNU <a href="https://www.gnu.org/software/emacs/">Emacs</a> 28.1 (<a href="https://orgmode.org">Org</a> mode 9.5.3).</p>
</div>
</body>
</html>
